app/views/books/new.html.erb

INSERT INTO "books" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2016-04-12 21:05:02.509107"], ["updated_at", "2016-04-12 21:05:02.509107"]]
---
<p>Find me in app/views/books/new.html.erb</p>
<p>Add a book to the library: <%= Book.create %> </p>