app/views/reservations/create.html.erb

<p>Find me in app/views/reservations/create.html.erb</p>
<p>These are the book reservations: <%= Reservation.create %></p>
---
INSERT INTO "reservations" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2016-04-13 17:08:01.266522"], ["updated_at", "2016-04-13 17:08:01.266522"]]