app/views/reservations/new.html.erb

INSERT INTO "reservations" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2016-04-13 17:08:00.596339"], ["updated_at", "2016-04-13 17:08:00.596339"]]
---
<p>Find me in app/views/reservations/new.html.erb</p>
<p>Adding a new reservation: <%= Reservation.create %></p>