app/controllers/books_controller.rb

  def index
    "hellow??"
    @books = Book.all
---
SELECT "books".* FROM "books"

  def update
    @book = Book.find(params[:id])
    @book.update(params[:book].permit!)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 980190963]]
UPDATE "books" SET "title" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "Jam I Am"], ["updated_at", "2016-04-13 20:06:18.545556"], ["id", 980190963]]

  def create
    @book = Book.create(params[:book].permit!)
---
INSERT INTO "books" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Sam I Am"], ["created_at", "2016-04-13 17:26:55.290336"], ["updated_at", "2016-04-13 17:26:55.290336"]]

  def destroy
    @book = Book.destroy(params[:id])
---
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 980190963]]