app/controllers/reservations_controller.rb

  def index
    "hallo?!"
    @reservations = Reservation.all
---
SELECT "reservations".* FROM "reservations"

  def show
    @reservation = Reservation.find(params[:id])
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT 1  [["id", 980190963]]

  def update
    @reservation = Reservation.find(params[:id])
    @reservation.update(params[:reservation].permit!)
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT 1  [["id", 980190963]]
UPDATE "reservations" SET "return" = ?, "updated_at" = ? WHERE "reservations"."id" = ?  [["return", nil], ["updated_at", "2016-04-13 21:01:39.014165"], ["id", 980190963]]

  def create
    @reservation = Reservation.create(params[:reservation].permit!)
---
INSERT INTO "reservations" ("return", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["return", "2016-04-13 23:01:42.000000"], ["book_id", 0], ["created_at", "2016-04-13 23:01:42.830971"], ["updated_at", "2016-04-13 23:01:42.830971"]]